---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadComponent
source: html/62ee3920-2a87-4fd1-d9e8-af9655d04456.htm
---
# Autodesk.Revit.DB.Structure.LoadComponent

An object that represents a load combination component.

## Syntax (C#)
```csharp
public class LoadComponent : IDisposable
```